erp3l/src/Catalogs/ДокументыБД/ДокументыБД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДокументыБД</name>
  <comment>Содержит реквизиты, необходимые для выборки данных из текущей и внешних информационных баз</comment>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ТипыБазДанных</owners>
  <attributes>
    <name>Синоним</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОбъектаМетаданных</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиОбменаДокументами</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьПриНеудачномПоискеПриИмпорте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбновлятьРеквизитыПриИмпорте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяВПроцессе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокументаБД</name>
    <type>
      <types>EnumRef.ТипыДокументовБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонДокументаБД</name>
    <type>
      <types>DefinedType.ШаблонДокументаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласуется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитСостояния</name>
    <type>
      <types>CatalogRef.ПеречисленияБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеРеквизитаСостоянияНаУтверждении</name>
    <type>
      <types>EnumRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеРеквизитаСостоянияУтвержден</name>
    <type>
      <types>EnumRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеРеквизитаСостоянияОтклонен</name>
    <type>
      <types>EnumRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьШаблоны</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитШаблонаДокумета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДляАналитики1УП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДляАналитики2УП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДляАналитики3УП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяВНастройкахРеглмента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьПравилоРасчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьПравилоПроверки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьБланк</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьСпособФормирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьУниверсальныйИмпорт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеРеквизитаСостоянияЧерновик</name>
    <type>
      <types>EnumRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьШаблонТрансляции</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчастокУчета</name>
    <type>
      <types>CatalogRef.УчасткиУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитСостоянияСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитРазделенияПоПроектам</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазделятьПоПроектам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделятьПоОрганизациям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитРазделенияПоОрганизациям</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитКонтрагент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДоговорКонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитСуммыДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеБлокироватьРеквизитыПриУтверждении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтсутствуетВКонфигурации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОтсутствуетВКонфигурации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Реквизиты</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Синоним</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипДанных</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Обязательный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИспользоватьДляСогласования</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Отображать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерАналитики</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеПримитивногоТипа</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДопРеквизитыМатрицыПроцесса</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоступныеФормыСхемРеквизитов</name>
    <attributes>
      <name>ИмяДоступнойФормы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьДоступныеФормыСхемРеквизитов</name>
    <attributes>
      <name>ИмяДоступнойФормы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erp3l/src/Catalogs/ТипыБазДанных/ТипыБазДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыБазДанных</name>
  <predefined>
    <items>
      <name>ОбменТаблДок</name>
      <description>Табличные документы (1С или Microsoft Excel)</description>
    </items>
    <items>
      <name>ТекущаяИБ</name>
      <description>Текущая информационная база</description>
    </items>
  </predefined>
  <attributes>
    <name>ВИБПоУмолчанию</name>
    <type>
      <types>CatalogRef.ВнешниеИнформационныеБазы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПлатформы</name>
    <type>
      <types>EnumRef.ПлатформыВнешнихИнформационныхБаз</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаПоУмолчанию</name>
    <comment>Если при сопоставлении получено пустое значение валюты, тогда подставить значение валюты по умолчанию</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоответствиеВидовСубконто</name>
    <attributes>
      <name>ВидСубконтоИБ</name>
      <type>
        <types>ChartOfCharacteristicTypesRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидАналитики</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erp3l/src/Catalogs/ДокументыБД/Forms/ФормаВыбора/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("Владелец") И ЗначениеЗаполнено(Параметры.Отбор.Владелец) Тогда
		
		ТипБД=Параметры.Отбор.Владелец;
		
		Если ТипБД.ВерсияПлатформы=Перечисления.ПлатформыВнешнихИнформационныхБаз.ADO Тогда
			
			ОбщегоНазначенияУХ.СообщитьОбОшибке(НСтр("ru = 'Для выбранного типа информационной базы доступны только таблицы ADO'"), Отказ, , СтатусСообщения.Информация);
			Возврат;
			
		КонецЕсли;
		
		Элементы.ТипБД.Доступность=Ложь;
		
		ДобавитьОтборПоПравилам();
		
	Иначе
		
		Если Параметры.ОбластьГенерации=Перечисления.ОбластиГенерацииОбъектов.ВнешняяИБ Тогда
			
			Запрос=Новый Запрос;
			Запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
			|	ТипыБазДанных.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.ТипыБазДанных КАК ТипыБазДанных
			|ГДЕ
			|	НЕ ТипыБазДанных.Ссылка = ЗНАЧЕНИЕ(Справочник.ТипыБазДанных.ТекущаяИБ)";
			
			Результат=Запрос.Выполнить().Выбрать();
			
			Если Результат.Следующий() Тогда
				
				ТипБД=Результат.Ссылка;
				
			КонецЕсли;
				
		Иначе
			
			Элементы.ТипБД.Доступность=(НЕ Параметры.Отбор.Свойство("ИспользуетсяВПроцессе"));	
			ТипБД=Справочники.ТипыБазДанных.ТекущаяИБ;
			
		КонецЕсли;
		
		ОбновитьОтборПоВладельцу();
		
	КонецЕсли;
	
	Если ТипБД=Справочники.ТипыБазДанных.ТекущаяИБ Тогда
		
		Элементы.СписокЗагрузитьИЗВИБ.Заголовок = НСтр("ru = 'Обновить по данным текущей ИБ'");
		Элементы.ИспользуетсяВПроцессе.Видимость = Истина;
		
	Иначе
		
		Элементы.СписокЗагрузитьИЗВИБ.Заголовок = НСтр("ru = 'Обновить по данным внешней ИБ'");
		Элементы.ИспользуетсяВПроцессе.Видимость = Ложь;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьОтборПоПравилам()
	
	Если Параметры.ДляЗаполненияПоПравилам Тогда
		
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПравилаЗаполненияОбъектовБД.Владелец КАК ДокументБД
		|ИЗ
		|	Справочник.ПравилаЗаполненияОбъектовБД КАК ПравилаЗаполненияОбъектовБД
		|ГДЕ
		|	НЕ ПравилаЗаполненияОбъектовБД.ПометкаУдаления
		|	И ПравилаЗаполненияОбъектовБД.Владелец.Владелец = &ТипБД";
		
		Запрос.УстановитьПараметр("ТипБД",ТипБД);
		
		СписокОтбора=Новый СписокЗначений;
		СписокОтбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ДокументБД"));
		
		ОбщегоНазначенияКлиентСерверУХ.УстановитьЭлементОтбора(Список.Отбор,"Ссылка",СписокОтбора,ВидСравненияКомпоновкиДанных.ВСписке,,Истина);
		
	КонецЕсли;
	
		
КонецПроцедуры // ДобавитьОтборПоПравилам()

&НаСервере
Процедура ОбновитьОтборПоВладельцу()
	
	Если Параметры.ДляЗаполненияПоПравилам Тогда
		
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПравилаЗаполненияОбъектовБД.Владелец КАК ДокументБД
		|ИЗ
		|	Справочник.ПравилаЗаполненияОбъектовБД КАК ПравилаЗаполненияОбъектовБД
		|ГДЕ
		|	НЕ ПравилаЗаполненияОбъектовБД.ПометкаУдаления
		|	И ПравилаЗаполненияОбъектовБД.Владелец.Владелец = &ТипБД";
		
		Запрос.УстановитьПараметр("ТипБД",ТипБД);
		
		СписокОтбора=Новый СписокЗначений;
		СписокОтбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ДокументБД"));
		
		ОбщегоНазначенияКлиентСерверУХ.УстановитьЭлементОтбора(Список.Отбор,"Ссылка",СписокОтбора,ВидСравненияКомпоновкиДанных.ВСписке,,Истина);
		
	Иначе
		
		ОбщегоНазначенияКлиентСерверУХ.УстановитьЭлементОтбора(Список.Отбор,"Владелец",ТипБД,ВидСравненияКомпоновкиДанных.Равно,,Истина);
		
	КонецЕсли;
	
	Если ТипБД=Справочники.ТипыБазДанных.ТекущаяИБ Тогда
		
		Элементы.СписокЗагрузитьИЗВИБ.Заголовок = НСтр("ru = 'Обновить по данным текущей ИБ'");
		Элементы.ИспользуетсяВПроцессе.Видимость = Истина;
		
	Иначе
		
		Элементы.СписокЗагрузитьИЗВИБ.Заголовок = НСтр("ru = 'Обновить по данным внешней ИБ'");
		Элементы.ИспользуетсяВПроцессе.Видимость = Ложь;
		
	КонецЕсли;
	
	ДобавитьОтборПоПравилам();
		
КонецПроцедуры // ОбновитьОтборПоВладельцу() 

&НаСервереБезКонтекста
Процедура ЗаполнитьСписокДокументов(ТипБД)
		
	ОбщегоНазначенияУХ.ЗаполнитьСписокДокументовБД(ТипБД);
	
КонецПроцедуры //

&НаКлиенте
Процедура ТипБДПриИзменении(Элемент)
	
	ОбновитьОтборПоВладельцу();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИЗВИБ(Команда)
	
	Если НЕ ЗначениеЗаполнено(ТипБД) Тогда
		
		ПоказатьПредупреждение(, НСтр("ru = 'Не указан тип внешней информационной базы.'"));
		Возврат;
		
	Иначе
		
		ЗаполнитьСписокДокументов(ТипБД);
		Элементы.Список.Обновить();
		
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура ТипБДНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.ОбластьГенерации) Тогда
		
		СтандартнаяОбработка=Ложь;
		ОткрытьФорму("Справочник.ТипыБазДанных.ФормаВыбора",Новый Структура("ОбластьГенерации",Параметры.ОбластьГенерации),Элемент);
		
	КонецЕсли;
	
КонецПроцедуры
